logs/fio/blk/p3600/4K2_s0_q0_0_v0_native_4K2.log
precondition: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
rand-read-4K-qd1: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-write-4K-qd1: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-read-4K-qd16: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-write-4K-qd16: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-rw-4K-qd16: (g=5): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-read-4K-qd128: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-write-4K-qd128: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-rw-4K-qd128: (g=8): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 15 processes

precondition: (groupid=0, jobs=1): err= 0: pid=27045: Wed Jul 24 21:04:30 2019
  write: IOPS=3682, BW=460MiB/s (483MB/s)(6909MiB/15011msec)
    slat (usec): min=12, max=390, avg=18.80, stdev= 5.38
    clat (usec): min=53, max=15915, avg=4323.57, stdev=3205.39
     lat (usec): min=78, max=15940, avg=4342.68, stdev=3205.11
    clat percentiles (usec):
     | 10.000th=[   91], 20.000th=[  783], 30.000th=[ 1745], 40.000th=[ 2933],
     | 50.000th=[ 4113], 70.000th=[ 6980], 90.000th=[ 8029], 99.000th=[10552],
     | 99.900th=[12518], 99.990th=[14746], 99.999th=[15926]
   bw (  KiB/s): min=368227, max=476208, per=79.93%, avg=376751.97, stdev=19240.18, samples=29
   iops        : min= 2876, max= 3720, avg=2942.86, stdev=150.35, samples=29
  lat (usec)   : 100=11.30%, 250=6.35%, 500=1.02%, 750=0.88%, 1000=4.86%
  lat (msec)   : 2=8.80%, 4=15.28%, 10=49.61%, 20=1.89%
  cpu          : usr=3.89%, sys=7.29%, ctx=44569, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,55274,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
rand-read-4K-qd1: (groupid=1, jobs=1): err= 0: pid=27051: Wed Jul 24 21:04:30 2019
   read: IOPS=11.8k, BW=46.1MiB/s (48.3MB/s)(1383MiB/30001msec)
    slat (usec): min=3, max=1188, avg= 6.16, stdev= 5.28
    clat (usec): min=2, max=2714, avg=76.65, stdev=29.53
     lat (usec): min=40, max=2720, avg=83.00, stdev=29.99
    clat percentiles (usec):
     | 10.000th=[   42], 20.000th=[   43], 30.000th=[   43], 40.000th=[   82],
     | 50.000th=[   87], 70.000th=[   93], 90.000th=[  104], 99.000th=[  106],
     | 99.900th=[  127], 99.990th=[ 1205], 99.999th=[ 2040]
   bw (  KiB/s): min=42410, max=48326, per=91.44%, avg=43159.78, stdev=759.60, samples=59
   iops        : min=10604, max=12081, avg=10789.61, stdev=189.86, samples=59
  lat (usec)   : 4=0.01%, 10=0.01%, 50=31.24%, 100=44.48%, 250=24.26%
  lat (usec)   : 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=6.52%, sys=11.21%, ctx=354016, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=354023,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write-4K-qd1: (groupid=2, jobs=1): err= 0: pid=27053: Wed Jul 24 21:04:30 2019
  write: IOPS=67.0k, BW=266MiB/s (278MB/s)(7966MiB/30001msec)
    slat (usec): min=2, max=844, avg= 2.75, stdev= 1.75
    clat (nsec): min=923, max=7023.3k, avg=11123.77, stdev=24891.21
     lat (usec): min=11, max=7026, avg=13.95, stdev=24.96
    clat percentiles (usec):
     | 10.000th=[   11], 20.000th=[   11], 30.000th=[   11], 40.000th=[   11],
     | 50.000th=[   11], 70.000th=[   11], 90.000th=[   12], 99.000th=[   19],
     | 99.900th=[   26], 99.990th=[   45], 99.999th=[ 6259]
   bw (  KiB/s): min=188475, max=245223, per=70.77%, avg=192418.97, stdev=7192.56, samples=59
   iops        : min=47118, max=61305, avg=48104.41, stdev=1798.11, samples=59
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=2.77%, 20=96.33%, 50=0.89%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=25.13%, sys=19.98%, ctx=2039192, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2039237,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-read-4K-qd16: (groupid=3, jobs=2): err= 0: pid=27056: Wed Jul 24 21:04:30 2019
   read: IOPS=96.3k, BW=376MiB/s (394MB/s)(11.0GiB/30001msec)
    slat (nsec): min=1867, max=872791, avg=3315.65, stdev=2651.11
    clat (nsec): min=639, max=6031.1k, avg=78757.83, stdev=53956.43
     lat (usec): min=7, max=6062, avg=82.18, stdev=54.05
    clat percentiles (usec):
     | 10.000th=[   10], 20.000th=[   14], 30.000th=[   57], 40.000th=[   84],
     | 50.000th=[   91], 70.000th=[  104], 90.000th=[  128], 99.000th=[  194],
     | 99.900th=[  277], 99.990th=[  979], 99.999th=[ 2966]
   bw (  KiB/s): min=116353, max=357215, per=40.14%, avg=154609.53, stdev=77248.19, samples=118
   iops        : min=29088, max=89302, avg=38652.04, stdev=19312.08, samples=118
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=11.82%, 20=13.99%, 50=3.64%
  lat (usec)   : 100=33.56%, 250=36.80%, 500=0.15%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=13.64%, sys=18.47%, ctx=1488427, majf=0, minf=6145
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=2888805,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write-4K-qd16: (groupid=4, jobs=2): err= 0: pid=27058: Wed Jul 24 21:04:30 2019
  write: IOPS=117k, BW=456MiB/s (478MB/s)(13.4GiB/30010msec)
    slat (usec): min=2, max=12117, avg= 5.38, stdev= 7.64
    clat (nsec): min=1358, max=12193k, avg=61840.93, stdev=245269.93
     lat (usec): min=10, max=12196, avg=67.43, stdev=245.27
    clat percentiles (usec):
     | 10.000th=[   22], 20.000th=[   24], 30.000th=[   25], 40.000th=[   26],
     | 50.000th=[   28], 70.000th=[   30], 90.000th=[   39], 99.000th=[ 1778],
     | 99.900th=[ 2278], 99.990th=[ 5735], 99.999th=[ 6980]
   bw (  KiB/s): min=207249, max=233044, per=46.98%, avg=219152.19, stdev=6515.11, samples=118
   iops        : min=51812, max=58261, avg=54787.69, stdev=1628.82, samples=118
  lat (usec)   : 2=0.01%, 10=0.13%, 20=5.69%, 50=89.93%, 100=1.53%
  lat (usec)   : 250=0.47%, 500=0.18%, 750=0.16%, 1000=0.26%
  lat (msec)   : 2=1.07%, 4=0.57%, 10=0.02%, 20=0.01%
  cpu          : usr=22.53%, sys=28.12%, ctx=118921, majf=0, minf=71
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,3499968,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-rw-4K-qd16: (groupid=5, jobs=2): err= 0: pid=27063: Wed Jul 24 21:04:30 2019
   read: IOPS=43.0k, BW=168MiB/s (176MB/s)(5041MiB/30007msec)
    slat (nsec): min=1909, max=12068k, avg=4298.75, stdev=11153.55
    clat (nsec): min=646, max=14432k, avg=170186.55, stdev=435214.07
     lat (usec): min=7, max=14435, avg=174.63, stdev=435.39
    clat percentiles (usec):
     | 10.000th=[   10], 20.000th=[   12], 30.000th=[   17], 40.000th=[   81],
     | 50.000th=[   87], 70.000th=[  102], 90.000th=[  165], 99.000th=[ 2606],
     | 99.900th=[ 3064], 99.990th=[ 3326], 99.999th=[ 6390]
   bw (  KiB/s): min=42981, max=97193, per=35.83%, avg=61631.47, stdev=22110.64, samples=118
   iops        : min=10745, max=24298, avg=15407.53, stdev=5527.65, samples=118
  write: IOPS=18.4k, BW=72.0MiB/s (75.5MB/s)(2161MiB/30007msec)
    slat (nsec): min=1999, max=984267, avg=4586.85, stdev=3202.57
    clat (nsec): min=677, max=7014.3k, avg=17806.47, stdev=35377.75
     lat (usec): min=10, max=7018, avg=22.54, stdev=35.56
    clat percentiles (usec):
     | 10.000th=[   12], 20.000th=[   12], 30.000th=[   13], 40.000th=[   14],
     | 50.000th=[   15], 70.000th=[   18], 90.000th=[   28], 99.000th=[   66],
     | 99.900th=[  151], 99.990th=[  297], 99.999th=[ 6063]
   bw (  KiB/s): min=17842, max=42132, per=35.84%, avg=26423.70, stdev=9493.83, samples=118
   iops        : min= 4460, max=10533, avg=6605.54, stdev=2373.48, samples=118
  lat (nsec)   : 750=0.01%, 1000=0.03%
  lat (usec)   : 2=0.02%, 4=0.01%, 10=11.67%, 20=35.12%, 50=8.65%
  lat (usec)   : 100=20.05%, 250=18.69%, 500=1.40%, 750=0.78%, 1000=0.69%
  lat (msec)   : 2=1.26%, 4=1.63%, 10=0.01%, 20=0.01%
  cpu          : usr=11.06%, sys=15.65%, ctx=1126732, majf=0, minf=9189
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1290502,553155,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read-4K-qd128: (groupid=6, jobs=2): err= 0: pid=27068: Wed Jul 24 21:04:30 2019
   read: IOPS=378k, BW=1476MiB/s (1547MB/s)(43.2GiB/30001msec)
    slat (nsec): min=1841, max=829072, avg=3245.07, stdev=2500.46
    clat (usec): min=6, max=3327, avg=165.26, stdev=61.64
     lat (usec): min=9, max=3329, avg=168.62, stdev=61.73
    clat percentiles (usec):
     | 10.000th=[  121], 20.000th=[  127], 30.000th=[  133], 40.000th=[  137],
     | 50.000th=[  141], 70.000th=[  182], 90.000th=[  239], 99.000th=[  347],
     | 99.900th=[  578], 99.990th=[ 1500], 99.999th=[ 2966]
   bw (  KiB/s): min=468862, max=665660, per=40.84%, avg=617167.92, stdev=41734.23, samples=118
   iops        : min=117215, max=166415, avg=154291.57, stdev=10433.58, samples=118
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.62%, 250=92.35%
  lat (usec)   : 500=6.85%, 750=0.12%, 1000=0.04%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=44.40%, sys=54.63%, ctx=81807, majf=0, minf=6303
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=11332987,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-write-4K-qd128: (groupid=7, jobs=2): err= 0: pid=27070: Wed Jul 24 21:04:30 2019
  write: IOPS=117k, BW=457MiB/s (479MB/s)(13.4GiB/30019msec)
    slat (usec): min=2, max=19928, avg= 5.36, stdev=11.78
    clat (nsec): min=1328, max=22289k, avg=539759.89, stdev=722414.00
     lat (usec): min=11, max=22291, avg=545.31, stdev=722.18
    clat percentiles (usec):
     | 10.000th=[  114], 20.000th=[  196], 30.000th=[  227], 40.000th=[  245],
     | 50.000th=[  265], 70.000th=[  302], 90.000th=[ 1942], 99.000th=[ 2671],
     | 99.900th=[ 4686], 99.990th=[ 6849], 99.999th=[ 7046]
   bw (  KiB/s): min=206872, max=235413, per=45.91%, avg=214958.81, stdev=4151.00, samples=118
   iops        : min=51718, max=58853, avg=53739.34, stdev=1037.75, samples=118
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.08%, 20=1.42%, 50=2.74%
  lat (usec)   : 100=4.49%, 250=33.51%, 500=38.17%, 750=2.16%, 1000=1.62%
  lat (msec)   : 2=6.12%, 4=9.54%, 10=0.14%, 20=0.01%, 50=0.01%
  cpu          : usr=23.59%, sys=27.54%, ctx=63093, majf=0, minf=57
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,3513853,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-rw-4K-qd128: (groupid=8, jobs=2): err= 0: pid=27076: Wed Jul 24 21:04:30 2019
   read: IOPS=166k, BW=648MiB/s (679MB/s)(18.0GiB/30009msec)
    slat (nsec): min=1865, max=11657k, avg=3207.56, stdev=7508.49
    clat (nsec): min=732, max=16083k, avg=363517.84, stdev=709021.70
     lat (usec): min=7, max=16088, avg=366.84, stdev=709.08
    clat percentiles (usec):
     | 10.000th=[   11], 20.000th=[   17], 30.000th=[   26], 40.000th=[   39],
     | 50.000th=[   63], 70.000th=[  141], 90.000th=[ 1319], 99.000th=[ 2933],
     | 99.900th=[ 3261], 99.990th=[ 6718], 99.999th=[13304]
   bw (  KiB/s): min=175776, max=380456, per=50.01%, avg=331751.20, stdev=69854.54, samples=120
   iops        : min=43944, max=95112, avg=82937.80, stdev=17463.60, samples=120
  write: IOPS=71.2k, BW=278MiB/s (291MB/s)(8342MiB/30009msec)
    slat (nsec): min=1893, max=788083, avg=3365.21, stdev=2435.02
    clat (nsec): min=805, max=12798k, avg=37771.68, stdev=103287.76
     lat (usec): min=9, max=12800, avg=41.25, stdev=103.37
    clat percentiles (usec):
     | 10.000th=[   12], 20.000th=[   13], 30.000th=[   16], 40.000th=[   20],
     | 50.000th=[   25], 70.000th=[   41], 90.000th=[   80], 99.000th=[  137],
     | 99.900th=[  355], 99.990th=[ 6063], 99.999th=[ 6783]
   bw (  KiB/s): min=76656, max=163488, per=50.01%, avg=142345.06, stdev=29905.67, samples=120
   iops        : min=19164, max=40872, avg=35586.27, stdev=7476.43, samples=120
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=6.65%, 20=23.07%, 50=25.26%
  lat (usec)   : 100=16.91%, 250=10.97%, 500=3.79%, 750=2.75%, 1000=2.33%
  lat (msec)   : 2=3.59%, 4=4.64%, 10=0.05%, 20=0.01%
  cpu          : usr=30.78%, sys=37.01%, ctx=1292958, majf=0, minf=3164
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=4977121,2135517,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=460MiB/s (483MB/s), 460MiB/s-460MiB/s (483MB/s-483MB/s), io=6909MiB (7245MB), run=15011-15011msec

Run status group 1 (all jobs):
   READ: bw=46.1MiB/s (48.3MB/s), 46.1MiB/s-46.1MiB/s (48.3MB/s-48.3MB/s), io=1383MiB (1450MB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=266MiB/s (278MB/s), 266MiB/s-266MiB/s (278MB/s-278MB/s), io=7966MiB (8353MB), run=30001-30001msec

Run status group 3 (all jobs):
   READ: bw=376MiB/s (394MB/s), 376MiB/s-376MiB/s (394MB/s-394MB/s), io=11.0GiB (11.8GB), run=30001-30001msec

Run status group 4 (all jobs):
  WRITE: bw=456MiB/s (478MB/s), 456MiB/s-456MiB/s (478MB/s-478MB/s), io=13.4GiB (14.3GB), run=30010-30010msec

Run status group 5 (all jobs):
   READ: bw=168MiB/s (176MB/s), 168MiB/s-168MiB/s (176MB/s-176MB/s), io=5041MiB (5286MB), run=30007-30007msec
  WRITE: bw=72.0MiB/s (75.5MB/s), 72.0MiB/s-72.0MiB/s (75.5MB/s-75.5MB/s), io=2161MiB (2266MB), run=30007-30007msec

Run status group 6 (all jobs):
   READ: bw=1476MiB/s (1547MB/s), 1476MiB/s-1476MiB/s (1547MB/s-1547MB/s), io=43.2GiB (46.4GB), run=30001-30001msec

Run status group 7 (all jobs):
  WRITE: bw=457MiB/s (479MB/s), 457MiB/s-457MiB/s (479MB/s-479MB/s), io=13.4GiB (14.4GB), run=30019-30019msec

Run status group 8 (all jobs):
   READ: bw=648MiB/s (679MB/s), 648MiB/s-648MiB/s (679MB/s-679MB/s), io=18.0GiB (20.4GB), run=30009-30009msec
  WRITE: bw=278MiB/s (291MB/s), 278MiB/s-278MiB/s (291MB/s-291MB/s), io=8342MiB (8747MB), run=30009-30009msec

Disk stats (read/write):
  nvme1n1: ios=20835364/11793406, merge=0/0, ticks=2671332/1880728, in_queue=4254464, util=72.38%